import { Content } from "../../pages/Article";

export const intro: Content = {
  header: "Въведение в JS",
  resource: [
    {
      header: "Какво е JS",
      data: [
        {
          type: "text",
          value: `JavaScript, често съкращаван JS, е език за програмиране, който е една от основните технологии на World Wide Web (Уърлд уайд уеб; съкратено WWW или W3; още The Web, буквално „Паяжината“), наричана също световна мрежа, мрежата[1] или само уеб, е информационна система от взаимно свързани хипертекстови документи, достъпни през интернет.). Заедно с HTML и CSS Към 2022 г. 98% от уебсайтовете използват JavaScript от страната на клиента (браузъра) за програмиране на уеб страниците, като често включват библиотеки (парчета код) на трети страни. Всички основни уеб браузъри имат специален JavaScript двигател за изпълнение на кода на устройствата на потребителите.`,
        },
        {
          type: "text",
          value:
            "JavaScript е език на високо ниво, често компилиран в реално време, който отговаря на стандарта ECMAScript. В JS има динамично типизиране, прототипно базирано програмиране, обектно ориентирано програмиране и първокласни функции. Той е мулти-парадигмен, поддържа програмиране на базата на събития, функционално програмиране и императивен стил на програмиране. Той има интерфейси за програмиране на приложения (API) за работа с текст, дати, регулярни изрази, стандартни структури от данни и обектен модел на документа (DOM).",
        },
        {
          type: "text",
          value:
            "Стандартът ECMAScript не включва вход/изход (I/O), като мрежови, съхранение на данни или графични възможносто. На практика уеб браузърът или друга система за изпълнение предоставя JavaScript API за I/O.",
        },
        {
          type: "text",
          value:
            "JavaScript двигателите първоначално са били използвани само в уеб браузъри, но сега са основни компоненти на някои сървъри и различни приложения. Най-популярната система за изпълнение за тази употреба е Node.js.",
        },
        {
          type: "text",
          value:
            "Въпреки че Java и JavaScript са сходни по име, синтаксис и съответните стандартни библиотеки, двата езика са различни и се различават значително по дизайн.",
        },
        { type: "code", value: `let num = 5;` },
        { type: "text", value: `Here, num is a variable. It's storing 5.` },
      ],
    },
  ],
};

export const variablesAndConstants: Content = {
  header: "JavaScript Variables and Constants",
  resource: [
    {
      header: "JavaScript Variables",
      data: [
        {
          type: "text",
          value: `In programming, a variable is a container (storage area) to hold data. For example,`,
        },
        { type: "code", value: `let num = 5;` },
        { type: "text", value: `Here, num is a variable. It's storing 5.` },
      ],
    },
  ],
};
